C9/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  13                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true; // Change for intermediary meshing
snap            true; // Change for intermediary meshing
addLayers       false; // Change for intermediary meshing

geometry
{
    interiorSurfaces_30deg_100pct.stl
    {
        type triSurfaceMesh;
        file "interiorSurfaces_30deg_100pct.stl";
        name interiorSurfaces;

        regions
        {
            Mesh
            {
                name solidSurfaces;
                //name interiorWalls; //rename to solidSurfaces
            }
        }
    }
  
	windowRefinementRegion
	{
		type	triSurfaceMesh;
		file "windowRefinementRegion.stl";
		name	windowRefinementRegion;
	}
	
		  
/*
    windowRefinementBox //Used later for the refinement region.
    {
        type searchableBox; // As mentioned later, we could also use an .stl to define this region if we wanted to!
        min (-0.5 -2.5 -2.5); //(-0.5m,x -2.5m,y -2.5m,z)
        max ( 0.5  2.5  2.5); //(+0.5m,x +2.5m,y +2.5m,z)
    }
*/
}

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

	// Refinement parameters
	// ~~~~~~~~~~~~~~~~~~~~~

	maxLocalCells       1000000;

	maxGlobalCells      4000000;

	minRefinementCells  0;

	maxLoadUnbalance    0.10;

	nCellsBetweenLevels 3;

///////////////////////////////////////////////////////////
// Castellation: Explicit feature edge refinement
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Interesting to see the different kinds of feature edge refinement options that are possible.
	
features
(
	{
	file "interiorSurfaces.eMesh";
	level 1;
	}
	
	{
	file	"interiorSurfacesWindowOnly.eMesh";
	level 3;
	}
   
/*
        {
            file "Window_1.eMesh";
            level 1;
        }
*/

/*   
        {
            file "surfacemesh.eMesh";
            level 0;
          //level 4;
        }
*/

/*
        {
            file "onshape_all.eMesh";
            level 0;
          //level 4;
        }
*/

/*
        {
            file "trimesh.eMesh";
            level 0;
          //level 4;
        }
*/

/*
        {
            file "line1.eMesh";
            level 4;
        }
*/

/*
        {
            file "point1.eMesh";
            level 4;
        }
*/

);
///////////////////////////////////////////////////////////
// Castellation: Surface based refinement
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	refinementSurfaces
	{
		interiorSurfaces
		{
		// global
		// Surface-wise min and max refinement level
		// Recommended to not use more than (4 4) here. Too much memory consumption
		// This refinement is done as function of the background mesh.
		// Uniform level (e.g. level (2 2) or level (3 3), etc. is recommended
		// as it is more likely to give you complete coverage.
		level (1 1); // Originally, (1 1), but I'd like to try (2 2)

			regions
			{
				Mesh
				{
					level (1 1); //(2 4) the first digit control the global refinement level and the 2nd digit controls the curvature refinement level
					// the 2nd digit is then based on the resolveFeatureAngle value
					patchInfo
					{
						type wall;
					}
				}
			}
		}
	}
    


	// Feature angle:
	resolveFeatureAngle 30;
	//resolveFeatureAngle 30; // Originally 30 (recommended). 
	//resolveFeatureAngle 60;		//To avoid too much refinement with curvature	
	planarAngle         30;

///////////////////////////////////////////////////////////
// Castellation: Region based refinement
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    refinementRegions
    {
        windowRefinementRegion //name not type of refinement box. We could also read an .stl here if we wanted to.
        {
            mode inside;
            //First value refers to distance from the surface, a large value would cover the whole region (inside the refinement region)
            //Second value is the refinement level
            levels ((1e15 2)); // ((1 0)) was ugly 
        }
    }
///////////////////////////////////////////////////////////
// Castellation: Mesh selection
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// Keep the +x outside region around the closed STL.
	locationInMesh (-2.5 2 1);

	allowFreeStandingZoneFaces true;
}

///////////////////////////////////////////////////////////
// Snap: Snap controls
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

snapControls
{
    nSmoothPatch        3; // Originally 3. 
    tolerance           2; // Originally 2.0. 0.5 resulted in 100% "blockiness".
    nSolveIter          30;
    nRelaxIter          5; // Originally 5. 
    nFeatureSnapIter    10; // Originally 10. 30 didn't really help. 
    implicitFeatureSnap true; // Originally false. True helped.
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;
    expansionRatio 1.15; // Originally 1.2. 1.8 really hurt. 1.2 worked well. 1.15 worked best. 1.10 worked well.
    // The final layer thickness of the boundary cell should be, e.g., 0.5 of the local undistorted
    // cell size in the background mesh.
    // Generally recommended as long as relative Sizes is true
	finalLayerThickness 0.18; // Originally 0.5. 0.25 worked better. 0.125 worked well. 0.25 worked best. 0.12 worked great for dx 0.20 and 5 boundary layers
	
	// Originally 0.001, but that seemed excessive.
	minThickness 0.001; // Originally 0.1, 0.01 worked well 0.001 worked best.

	layers
	{
		solidSurfaces
		{
			// Number of boundary layers to use for the layer addition.
            nSurfaceLayers 5; // Originally 3
        }
    }

    nGrow 0; // Originally 0. Antyhing above was not good.
    featureAngle 215; // Originally 130. Reducing below 130 removed layers! Having problems with sharp edges. 270 worked very well, increasing to 330 messed it all up! 215 worked a bit better than 270. 
    maxFaceThicknessRatio 0.8; // Originally 0.5, .125 worked very well, 0.0625 worked well
    nSmoothSurfaceNormals 1; // Originally 1.
    nSmoothThickness 20; // Originally 10
    minMedialAxisAngle 90;
    //minMedianAxisAngle 90;
    maxThicknessToMedialRatio 0.8; // Originally 0.3
    nSmoothNormals 5;
	nMedialAxisIter 20;
	slipFeatureAngle 30; // Originally 30
	nRelaxIter 5; // Originally 5
	nBufferCellsNoExtrude 0;
	nLayerIter 300; // Originally 50. 300 didn't help.
	nRelaxedIter 20; // Originally 20
}

meshQualityControls
{
	#include "meshQualityDict"

	relaxed
	{
        maxNonOrtho 75;
	}

	// Number of error distribution iterations
	nSmoothScale 4;
	
	// amount to scale back displacement at error points
    	errorReduction 0.75;
}

debugFlags
(
);

writeFlags
(
	scalarLevels
	layerSets
	layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
